from flask_wtf import FlaskForm
from wtforms import SelectField, SubmitField
from wtforms.validators import DataRequired

class RatingForm(FlaskForm):
    relevance = SelectField('Актуальность',
                            choices= [(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                      (9, '9'), (10, '10')])
    integrity = SelectField('Цельность',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    validity = SelectField('Аргументированность',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    resonance = SelectField('Резонансность',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    accuracy = SelectField('Точность и доходчивость',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    ethnicity = SelectField('Профессионально-этический подход',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    availability = SelectField('Доступность',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    materials_cycle = SelectField('Цикл материалов',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    expression_of_thought = SelectField('Выражение мысли',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    integrity = SelectField('Единство передачи',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    personalized_character = SelectField('Персонифицированный подход',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    artistic_techniques = SelectField('Художественные приемы',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    operators_work = SelectField('Работа оператора',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    promotional_materials = SelectField('Рекламные материалы',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    journalistic_stamps = SelectField('Журналистские штампы',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    сustom_nature = SelectField('Заказной харатер',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    grammatical_errors = SelectField('Грамматические ошибки',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    orthoepic_norms = SelectField('Орфоэпические и лексические нормы',
                            choices=[(1, '1'), (2, '2'), (3, '3'), (4, '4'), (5, '5'), (6, '6'), (7, '7'), (8, '8'),
                                     (9, '9'), (10, '10')])
    submit = SubmitField('Завершить проверку')